#+TILE: Baddah Bing - Character Sheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[1fd68bde4889e019495d05294461b09b0afb80e5]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=19
  #+CONSTANTS: DEX=14
  #+CONSTANTS: CON=14
  #+CONSTANTS: INT=8
  #+CONSTANTS: WIS=10
  #+CONSTANTS: CHA=12
  #+CONSTANTS: PROF=3
  :end:
  
* Traits
  | Level | Race  | Subrace    | Class   | Subclass | Age | Alignment    | Size        | Weight |
  |-------+-------+------------+---------+----------+-----+--------------+-------------+--------|
  |     6 | Gnome | Rock Gnome | Fighter | Brute    |  20 | Chaotic Good | Small (3ft) | 34lb   |

* Stats  
  | Speed | Hit Points | AC | Death Saves | Inspiration |
  |-------+------------+----+-------------+-------------|
  | 25 ft | 48/50      | 18 |             |             |

* Abilities and Skills
  #+name: stats
  | Ability | Score | Mod | PB | Roll      | Skill           |
  |---------+-------+-----+----+-----------+-----------------|
  | STR     |    19 |   4 | X  | 1d20 + 7  | Saving Throw    |
  |         |       |     |    | 1d20 + 4  | Athletics       |
  |---------+-------+-----+----+-----------+-----------------|
  | DEX     |    14 |   2 | X  | 1d20 + 5  | Saving Throw    |
  |         |       |     |    | 1d20 + 2  | Acrobatics      |
  |         |       |     | X  | 1d20 + 5  | Sleight of Hand |
  |         |       |     |    | 1d20 + 2  | Stealth         |
  |---------+-------+-----+----+-----------+-----------------|
  | CON     |    14 |   2 | X  | 1d20 + 5  | Saving Throw    |
  |---------+-------+-----+----+-----------+-----------------|
  | INT     |     8 |  -1 |    | 1d20 + -1 | Saving Throw    |
  |         |       |     |    | 1d20 + -1 | Arcana          |
  |         |       |     |    | 1d20 + -1 | History         |
  |         |       |     |    | 1d20 + -1 | Investigation   |
  |         |       |     |    | 1d20 + -1 | Nature          |
  |         |       |     |    | 1d20 + -1 | Religion        |
  |---------+-------+-----+----+-----------+-----------------|
  | WIS     |    10 |   0 |    | 1d20 + 0  | Saving Throw    |
  |         |       |     |    | 1d20 + 0  | Animal Handling |
  |         |       |     | X  | 1d20 + 3  | Insight         |
  |         |       |     |    | 1d20 + 0  | Medicine        |
  |         |       |     |    | 1d20 + 0  | Perception      |
  |         |       |     |    | 1d20 + 0  | Survival        |
  |---------+-------+-----+----+-----------+-----------------|
  | CHA     |    12 |   1 |    | 1d20 + 1  | Saving Throw    |
  |         |       |     | X  | 1d20 + 4  | Deception       |
  |         |       |     | X  | 1d20 + 4  | Intimidation    |
  |         |       |     |    | 1d20 + 1  | Performance     |
  |         |       |     |    | 1d20 + 1  | Persuasion      |
  |---------+-------+-----+----+-----------+-----------------|
  | PROF    |     3 |     |    |           |                 |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))

** Abilities
*** Second Wind
    You have a limited well of stamina that you can draw on to protect yourself
    from harm. On your turn, you can use a bonus action to regain hit points equal
    to 1d10 + your fighter level.

    Once you use this feature, you must finish a short or long rest before you can use it again.

*** Action Surge
    You can push yourself beyond your normal limits for a moment.
    On your turn, you can take one additional action.

    Once you use this feature, you must finish a short or long rest before you can use it again.
    Starting at 17th level, you can use it twice before a rest, but only once on the same turn.

*** Brute Force
    Whenever you hit with a weapon that you’re proficient with and deal damage,
    the weapon’s damage increases by an amount based on your level in this class

| Lvl | Damage |
|-----+--------|
|   3 |    1d4 |
|  10 |    1d6 |
|  16 |    1d8 |
| 20  |   1d10 |

** Feats
*** Resilient 
    - Choose one ability score. You gain the following benefits:
      Increase the chosen ability score by 1, to a maximum of 20.
    - You gain proficiency in saving throws using the chosen ability : DEX

* Attacks
  #+NAME: attacks
  | Weapon           | Ability | Prof | Type        | Die | Mod To Hit | Roll    |
  |------------------+---------+------+-------------+-----+------------+---------|
  | Shortsword       | DEX     | X    | Piercing    | 1d6 |          5 | 1d6 + 2 |
  | Shortsword       | STR     | X    | Piercing    | 1d6 |          7 | 1d6 + 4 |
  | Boom's Guantlets | STR     | X    | Bludgeoning | 1d4 |          7 | 1d4 + 4 |
  #+TBLFM: $6='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))
 
* Proficiencies
  | Languages | Tools          | Armor   | Weapons |
  |-----------+----------------+---------+---------|
  | Common    | Tinker's Tools | Light   | Simple  |
  | Gnomish   | Disguise Kit   | Medium  | Martial |
  |           | Forgery Kit    | Heavy   |         |
  |           |                | Shields |         |

* Equipment
  | Name           | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
  |----------------+----------+-----------+--------------+--------------------+-----------------|
  | Arrow          |       20 |       .05 |          .05 |                 1. |              1. |
  | Short Sword    |        3 |        10 |            2 |                  6 |              30 |
  | Short Bow      |        1 |        25 |            2 |                  2 |              25 |
  | Mastiff        |        2 |        25 |            0 |                  0 |              50 |
  | Common Clothes |        2 |        .5 |            3 |                  6 |              1. |
  | Smith Tools    |        1 |        20 |            8 |                  8 |              20 |
  | Tinker Tools   |        1 |        50 |           10 |                 10 |              50 |
  | Saddle Bags    |        2 |         4 |            8 |                 16 |               8 |
  | Rations        |        4 |        .5 |            2 |                  8 |              2. |
  | Fine clothes   |        2 |        15 |            3 |                  6 |              30 |
  | Bed Roll       |        1 |         0 |              |                    |                 |
  |----------------+----------+-----------+--------------+--------------------+-----------------|
  | Carry Capacity |      190 |           |              |                  0 |               0 |
  #+TBLFM: $5=($2 * $4)
  #+TBLFM: $6=($2 * $3)
  #+TBLFM: @15$5=vsum(@2$5..@15$5)
  #+TBLFM: @15$6=vsum(@2$6..@10$6)
  #+TBLFM: @15$2=($STR * 10)

** Money
   | Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
   |--------+--------+----------+------+----------+--------------|
   |      0 |      0 |        0 |    0 |        0 |            0 |
   #+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10))
   

   
